// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

// 456 -> 5
// 782 -> 8
// 918 -> 1


// Console.WriteLine("напиши трёхзначное число");
// int a =int.Parse(Console.ReadLine());
// int b = a%100/10;
// Console.WriteLine (b);

///////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////НЕ СМОГ//////////////////////////////////////////////////
// Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

// 645 -> 5

// 78 -> третьей цифры нет

// 32679 -> 6

// Console.WriteLine("Введи число");
// int a = int.Parse(Console.ReadLine());
// int b = a%10;
// Console.WriteLine (b);

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

// 6 -> да
// 7 -> да
// 1 -> нет
// Console.WriteLine("Напиши номер дня недели от 1 до 7");
// int a = int.Parse(Console.ReadLine());
// if (a==6||a==7)
// {
// Console.WriteLine("ДА");
// }
// else
//  {
// Console.WriteLine("нет");
// }
